{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, null, null, 3]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "name": "zero_padding2d_1", "padding": [[3, 3], [3, 3]], "trainable": false}}, {"inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [7, 7], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn_conv1", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn_conv1", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": false}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2a_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2a_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": false}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "res2a_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2a_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2a_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": false}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "res2a_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2a_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch1", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2a_branch1", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2a_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2a_branch1", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": false}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": false}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "res2b_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2b_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2b_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": false}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "res2b_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2b_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2b_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": false}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "res2b_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2b_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2b_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": false}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": false}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "res2c_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2c_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2c_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": false}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "res2c_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2c_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2c_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "name": "activation_9", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": false}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "res2c_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res2c_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn2c_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": false}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_10", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": false}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3a_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3a_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "name": "activation_11", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": false}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "res3a_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3a_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3a_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "name": "activation_12", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": false}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "res3a_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3a_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch1", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3a_branch1", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3a_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3a_branch1", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": false}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_13", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": false}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "res3b_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3b_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3b_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "name": "activation_14", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": false}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "res3b_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3b_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3b_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "name": "activation_15", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": false}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "res3b_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3b_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "name": "bn3b_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3b_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": false}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_16", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_16", "trainable": false}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "res3c_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3c_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "name": "bn3c_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3c_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "name": "activation_17", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": false}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "res3c_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3c_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "name": "bn3c_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3c_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "name": "activation_18", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_18", "trainable": false}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "res3c_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3c_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "name": "bn3c_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3c_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": false}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_19", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": false}}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "res3d_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3d_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3d_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "name": "activation_20", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_20", "trainable": false}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "res3d_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3d_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3d_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "name": "activation_21", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_21", "trainable": false}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "res3d_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res3d_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "name": "bn3d_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn3d_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": false}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_22", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_22", "trainable": false}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4a_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "name": "bn4a_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4a_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "name": "activation_23", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_23", "trainable": false}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "res4a_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4a_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "name": "bn4a_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4a_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "name": "activation_24", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_24", "trainable": false}}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "res4a_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4a_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch1", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4a_branch1", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "name": "bn4a_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4a_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "name": "bn4a_branch1", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4a_branch1", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": false}}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_25", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_25", "trainable": false}}, {"inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "res4b_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4b_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "name": "bn4b_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4b_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "name": "activation_26", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_26", "trainable": false}}, {"inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "res4b_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4b_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "name": "bn4b_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4b_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "name": "activation_27", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_27", "trainable": false}}, {"inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "res4b_branch2c", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4b_branch2c", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "name": "bn4b_branch2c", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4b_branch2c", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": false}}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_28", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_28", "trainable": false}}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "res4c_branch2a", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4c_branch2a", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "name": "bn4c_branch2a", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4c_branch2a", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "name": "activation_29", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": false}}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "res4c_branch2b", "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1], "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "res4c_branch2b", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "name": "bn4c_branch2b", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "name": "bn4c_branch2b", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": false}}, {"inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "name": "activation_30", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_30", "trainable": false}}, {"inbound_nodes": [[["activation_30", 0, 0, {}]]], "name": 